index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-06 Mon 14:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hugo Arregui</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="static/css/latex.css" />
<link rel="stylesheet" type="text/css" href="static/css/custom.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hugo Arregui</h1>
<dl class="org-dl">
<dt>Birth date:</dt><dd>December 2, 1986</dd>
<dt>Nationality:</dt><dd>Argentina</dd>
<dt>Email:</dt><dd>hugo.arregui.laboral at gmail.com</dd>
<dt>Links:</dt><dd><a href="http://ar.linkedin.com/in/hugoarregui/">LinkedIn</a>, <a href="https://github.com/hugoArregui">GitHub</a>, <a href="https://gitlab.com/hugoArregui">GitLab</a></dd>
</dl>

<div id="outline-container-org731c93e" class="outline-2">
<h2 id="org731c93e">Professional Experience</h2>
<div class="outline-text-2" id="text-org731c93e">
</div>
<div id="outline-container-org4fcb260" class="outline-3">
<h3 id="org4fcb260">03/2022 - [PRESENT]: Staff Engineer at <a href="https://decentraland.org">Decentraland</a> (Working remotely)</h3>
</div>
<div id="outline-container-org2271f71" class="outline-3">
<h3 id="org2271f71">02/2021 - 03/2022: Engineer at <a href="https://www.polarsteps.com/">PolarSteps</a> (Working remotely)</h3>
</div>
<div id="outline-container-orgaf6cebf" class="outline-3">
<h3 id="orgaf6cebf">03/2020 - 02/2021: Engineer at <a href="https://bigtime.gg/">Big Time Studios</a> (Working remotely)</h3>
<div class="outline-text-3" id="text-orgaf6cebf">
<ul class="org-ul">
<li>Design and implement backend services</li>
<li>PoC Research and development</li>
<li>Stack: <i>typescript, Unreal Engine</i></li>
</ul>
</div>
</div>
<div id="outline-container-org3742b5f" class="outline-3">
<h3 id="org3742b5f">09/2018 - 03/2020: Tech Leader at <a href="https://decentraland.org">Decentraland</a> (Working remotely)</h3>
<div class="outline-text-3" id="text-org3742b5f">
<ul class="org-ul">
<li>Design and implement Decentraland's platform: identity, communications,
user's shared state.</li>
<li>Research and development</li>
<li>Stack: <i>golang, webrtc, auth0, C++, Unreal Engine</i></li>
</ul>
</div>
</div>
<div id="outline-container-org7d72176" class="outline-3">
<h3 id="org7d72176">03/2016 - 09/2018: Engineer at <a href="https://auth0.com/">Auth0</a> (Working remotely)</h3>
<div class="outline-text-3" id="text-org7d72176">
<ul class="org-ul">
<li>Development and maintenance of Auth0's Management API</li>
<li>Support users search engine using ElasticSearch</li>
<li>Stack: <i>nodejs, express, JWT, elasticsearch, mongodb, hapi.js, AWS, git, GitHub, Kibana, Datadog, valgrind</i></li>
</ul>
</div>
</div>

<div id="outline-container-org864b5ca" class="outline-3">
<h3 id="org864b5ca">01/2015 - 06/2015: Senior Python Developer at <a href="http://jampp.com/">Jampp</a> (Working remotely)</h3>
<div class="outline-text-3" id="text-org864b5ca">
<ul class="org-ul">
<li>Worked on Jampp's Machine Learning backend.</li>
<li>Stack: <i>zeromq, sklearn, pandas, numpy, machine learning, PostgreSQL</i></li>
</ul>
</div>
</div>

<div id="outline-container-org7099451" class="outline-3">
<h3 id="org7099451">02/2013 - 02/2015: Scheme Developer at <a href="http://www.bevuta.com/en/">bevuta IT GmbH</a> (Working remotely)</h3>
<div class="outline-text-3" id="text-org7099451">
<ul class="org-ul">
<li>Worked on the android version of sayHey (a chat app) using Java + CHICKEN scheme + JNI.</li>
<li>Stack: <i>android, scheme, CHICKEN scheme, C, JNI, SQLite</i></li>

<li>Part of this work is open-source, for example, <a href="https://github.com/chicken-mobile/jni">the CHICKEN bindings</a> for Java (in which I worked a lot)</li>
</ul>
</div>
</div>

<div id="outline-container-org95bf0e3" class="outline-3">
<h3 id="org95bf0e3">08/2010 - 01/2014: C++ Developer (Ad honorem) at FuDePAN (Working remotely)</h3>
<div class="outline-text-3" id="text-org95bf0e3">
<ul class="org-ul">
<li>Developed and implemented bioinformatic tools.</li>
<li>Stack: <i>C++, Template Metaprogramming, googletest, googlemock, g++, make, Scons, Jenkins, SVN, Mercurial, gdb</i></li>
</ul>
</div>
</div>

<div id="outline-container-org8a1ac81" class="outline-3">
<h3 id="org8a1ac81">07/2011 - 01/2013: Regional Coordinator for Buenos Aires (Ad honorem) at FuDePAN (Working remotely)</h3>
<div class="outline-text-3" id="text-org8a1ac81">
<ul class="org-ul">
<li>Volunteers coordination. Project management.</li>
</ul>
</div>
</div>

<div id="outline-container-org0d7c477" class="outline-3">
<h3 id="org0d7c477">07/2010 - 03/2016: Freelance Software Engineer (Working remotely)</h3>
<div class="outline-text-3" id="text-org0d7c477">
<ul class="org-ul">
<li>Developed issue tracking system for an important petrol company. <i>(python django psql jQuery javascript)</i></li>
<li>Provided consulting services for a real estate online portal. <i>(ruby sequel sinatra redis)</i></li>
<li>Developed a multi-platform mobile app to organize and manage social events. <i>(clojurescript clojure phonegap/cordova)</i></li>
<li>Provided freelance development services for <a href="http://www.ticketek.com.ar/">Ticketek</a>. <i>(python django)</i></li>
<li>Developed a crawler infrastructure for an important deal network. <i>(python scrapy flask)</i></li>
</ul>
</div>
</div>

<div id="outline-container-org6900ee0" class="outline-3">
<h3 id="org6900ee0">04/2010 - 01/2011: Ssr. Python Developer at TeraCode</h3>
<div class="outline-text-3" id="text-org6900ee0">
<ul class="org-ul">
<li>Worked on Performable's website/platform.</li>
<li>Stack: <i>python, Tornado, django, SQLAlchemy, jQuery, MySQL, Scrum</i></li>
</ul>
</div>
</div>

<div id="outline-container-orga75c63b" class="outline-3">
<h3 id="orga75c63b">04/2008 - 04/2010: Ssr. Java Developer at Livra</h3>
<div class="outline-text-3" id="text-orga75c63b">
<ul class="org-ul">
<li>Worked on Livra’s website. Creating and maintaining marketing tools for surveys, statistics, etc.</li>
<li>Stack: <i>java, Apache Wicket, wicket, Hibernate, JUnit, Velocity, Lucene, PostgreSQL, Web Services, Rest, Jersey, SOAP, Axis, prototype, scriptaculous, Eclipse, Tomcat, Jetty, ant, Maven, SVN, Prototype</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgc23989d" class="outline-3">
<h3 id="orgc23989d">08/2007 - 04/2008: Java Developer at Thales Information Systems</h3>
<div class="outline-text-3" id="text-orgc23989d">
<ul class="org-ul">
<li>Stack: <i>IVR, asterix, structs, hibernate, spring</i></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org76f0553" class="outline-2">
<h2 id="org76f0553">Publications</h2>
<div class="outline-text-2" id="text-org76f0553">
<ul class="org-ul">
<li>2012 - <a href="http://accu.org/index.php/journals/1916">ACCU Overload Magazine #109, June 2012</a>: Curiously Recursive Template Problems with Aspect Oriented Programming. Hugo Arregui, Carlos Castro, Daniel Gutson</li>
<li>2011 - 2do Congreso Argentino de Biologia Computacional: Biopp2, biological alphabet manipulation library. Hugo Arregui, Daniel Gutson</li>
<li>2011 - 2do Congreso Argentino de Biologia Computacional: Backbones Generator v2. Hugo Arregui, Rodrigo Castaño, Lucía Lauría, Rafael Garabato, Elmer Fernández, Marcos Villarreal</li>
</ul>
</div>
</div>

<div id="outline-container-org720aecb" class="outline-2">
<h2 id="org720aecb">Education</h2>
<div class="outline-text-2" id="text-org720aecb">
<dl class="org-dl">
<dt>2010 - 2014</dt><dd>System Analyst at CAECE University</dd>
<dt>2017 - Elastic</dt><dd>Advanced Elasticsearch: Data Modeling</dd>
<dt>2013 - Coursera</dt><dd>Image and video processing: From Mars to Hollywood with a stop at the hospital</dd>
<dt>2012 - Coursera</dt><dd>Algorithms: Design and Analysis Part I</dd>
<dt>2011 - ECI 2011 (UBA)</dt><dd>Programación de Seguridad mediante Bibliotecas - (Security programming using libraries)</dd>
<dt>2011 - ECI 2011 (UBA)</dt><dd>Programación distribuida y paralela usando MPI - (Distributed and parallel programming using MPI)</dd>
<dt>2010 - FuDePAN</dt><dd>C++ Internals</dd>
<dt>2010 - FuDePAN</dt><dd>C/C++ Good Practices</dd>
<dt>2005 - 2010</dt><dd>System Engineering at Universidad Tecnologica Nacional (Unfinished)</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-06 Mon 14:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
